{"format": "graph-model", "generatedBy": "2.5.0-rc0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"src": {"name": "src:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "r2i:0": {"name": "r2i:0", "dtype": "DT_FLOAT", "tensorShape": {"unknownRank": true}}, "downsample_ratio:0": {"name": "downsample_ratio:0", "dtype": "DT_FLOAT", "tensorShape": {"unknownRank": true}}, "r1i:0": {"name": "r1i:0", "dtype": "DT_FLOAT", "tensorShape": {"unknownRank": true}}, "r3i:0": {"name": "r3i:0", "dtype": "DT_FLOAT", "tensorShape": {"unknownRank": true}}, "r4i:0": {"name": "r4i:0", "dtype": "DT_FLOAT", "tensorShape": {"unknownRank": true}}}, "outputs": {"r4o": {"name": "Identity_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "64"}]}}, "pha": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "fgr": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "r3o": {"name": "Identity_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "40"}]}}, "r2o": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "20"}]}}, "r1o": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}}}, "modelTopology": {"node": [{"name": "downsample_ratio", "op": "Placeholder", "attr": {"shape": {"shape": {"unknownRank": true}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "r1i", "op": "Placeholder", "attr": {"shape": {"shape": {"unknownRank": true}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "r2i", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"unknownRank": true}}}}, {"name": "r3i", "op": "Placeholder", "attr": {"shape": {"shape": {"unknownRank": true}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "r4i", "op": "Placeholder", "attr": {"shape": {"shape": {"unknownRank": true}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "src", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/conv_bn_activation/conv2d/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/conv_bn_activation/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual/sequential/conv_bn_activation_1/depthwise_conv2d/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual/sequential/conv_bn_activation_1/depthwise_conv2d/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual/sequential/conv_bn_activation_2/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual/sequential/conv_bn_activation_2/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_1/sequential_1/conv_bn_activation_3/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_1/sequential_1/conv_bn_activation_3/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_1/sequential_1/conv_bn_activation_4/depthwise_conv2d_1/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_1/sequential_1/conv_bn_activation_4/depthwise_conv2d_1/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_1/sequential_1/conv_bn_activation_5/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_1/sequential_1/conv_bn_activation_5/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_2/sequential_2/conv_bn_activation_6/conv2d_4/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "72"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_2/sequential_2/conv_bn_activation_6/conv2d_4/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_2/sequential_2/conv_bn_activation_7/depthwise_conv2d_2/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "72"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_2/sequential_2/conv_bn_activation_7/depthwise_conv2d_2/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_2/sequential_2/conv_bn_activation_8/conv2d_5/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "72"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_2/sequential_2/conv_bn_activation_8/conv2d_5/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_3/sequential_3/conv_bn_activation_9/conv2d_6/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_3/sequential_3/conv_bn_activation_9/conv2d_6/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_3/sequential_3/conv_bn_activation_10/depthwise_conv2d_3/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "72"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_3/sequential_3/conv_bn_activation_10/depthwise_conv2d_3/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_3/sequential_3/conv_bn_activation_11/conv2d_9/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "72"}, {"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_3/sequential_3/conv_bn_activation_11/conv2d_9/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_4/sequential_4/conv_bn_activation_12/conv2d_10/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "40"}, {"size": "120"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_4/sequential_4/conv_bn_activation_12/conv2d_10/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "120"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_4/sequential_4/conv_bn_activation_13/depthwise_conv2d_4/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "120"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_4/sequential_4/conv_bn_activation_13/depthwise_conv2d_4/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "120"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_4/sequential_4/conv_bn_activation_14/conv2d_13/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "120"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_4/sequential_4/conv_bn_activation_14/conv2d_13/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_5/sequential_5/conv_bn_activation_15/conv2d_14/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "40"}, {"size": "120"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_5/sequential_5/conv_bn_activation_15/conv2d_14/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "120"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_5/sequential_5/conv_bn_activation_16/depthwise_conv2d_5/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "120"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_5/sequential_5/conv_bn_activation_16/depthwise_conv2d_5/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "120"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_5/sequential_5/conv_bn_activation_17/conv2d_17/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "120"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_5/sequential_5/conv_bn_activation_17/conv2d_17/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_6/sequential_6/conv_bn_activation_18/conv2d_18/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "40"}, {"size": "240"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_6/sequential_6/conv_bn_activation_18/conv2d_18/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_6/sequential_6/conv_bn_activation_19/depthwise_conv2d_6/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "240"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_6/sequential_6/conv_bn_activation_19/depthwise_conv2d_6/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "240"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_6/sequential_6/conv_bn_activation_20/conv2d_19/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "240"}, {"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_6/sequential_6/conv_bn_activation_20/conv2d_19/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_7/sequential_7/conv_bn_activation_21/conv2d_20/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "80"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_7/sequential_7/conv_bn_activation_21/conv2d_20/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_7/sequential_7/conv_bn_activation_22/depthwise_conv2d_7/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "200"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_7/sequential_7/conv_bn_activation_22/depthwise_conv2d_7/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_7/sequential_7/conv_bn_activation_23/conv2d_21/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "200"}, {"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_7/sequential_7/conv_bn_activation_23/conv2d_21/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_8/sequential_8/conv_bn_activation_24/conv2d_22/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "80"}, {"size": "184"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_8/sequential_8/conv_bn_activation_24/conv2d_22/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "184"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_8/sequential_8/conv_bn_activation_25/depthwise_conv2d_8/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "184"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_8/sequential_8/conv_bn_activation_25/depthwise_conv2d_8/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "184"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_8/sequential_8/conv_bn_activation_26/conv2d_23/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "184"}, {"size": "80"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_8/sequential_8/conv_bn_activation_26/conv2d_23/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_9/sequential_9/conv_bn_activation_27/conv2d_24/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "80"}, {"size": "184"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_9/sequential_9/conv_bn_activation_27/conv2d_24/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "184"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_9/sequential_9/conv_bn_activation_28/depthwise_conv2d_9/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "184"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_9/sequential_9/conv_bn_activation_28/depthwise_conv2d_9/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "184"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_9/sequential_9/conv_bn_activation_29/conv2d_25/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "184"}, {"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_9/sequential_9/conv_bn_activation_29/conv2d_25/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_10/sequential_10/conv_bn_activation_30/conv2d_26/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "80"}, {"size": "480"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_10/sequential_10/conv_bn_activation_30/conv2d_26/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_10/sequential_10/conv_bn_activation_31/depthwise_conv2d_10/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "480"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_10/sequential_10/conv_bn_activation_31/depthwise_conv2d_10/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "480"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_10/sequential_10/conv_bn_activation_32/conv2d_29/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "480"}, {"size": "112"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_10/sequential_10/conv_bn_activation_32/conv2d_29/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_11/sequential_11/conv_bn_activation_33/conv2d_30/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "112"}, {"size": "672"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_11/sequential_11/conv_bn_activation_33/conv2d_30/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_11/sequential_11/conv_bn_activation_34/depthwise_conv2d_11/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "672"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_11/sequential_11/conv_bn_activation_34/depthwise_conv2d_11/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_11/sequential_11/conv_bn_activation_35/conv2d_33/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "672"}, {"size": "112"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_11/sequential_11/conv_bn_activation_35/conv2d_33/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "112"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_12/sequential_12/conv_bn_activation_36/conv2d_34/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "112"}, {"size": "672"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_12/sequential_12/conv_bn_activation_36/conv2d_34/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "672"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_12/sequential_12/conv_bn_activation_38/conv2d_37/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "672"}, {"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_12/sequential_12/conv_bn_activation_38/conv2d_37/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_13/sequential_13/conv_bn_activation_39/conv2d_38/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_13/sequential_13/conv_bn_activation_39/conv2d_38/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_13/sequential_13/conv_bn_activation_41/conv2d_41/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_13/sequential_13/conv_bn_activation_41/conv2d_41/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_14/sequential_14/conv_bn_activation_42/conv2d_42/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_14/sequential_14/conv_bn_activation_42/conv2d_42/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_14/sequential_14/conv_bn_activation_44/conv2d_45/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/inverted_residual_14/sequential_14/conv_bn_activation_44/conv2d_45/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/conv_bn_activation_45/conv2d_46/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/mobile_net_v3_encoder/conv_bn_activation_45/conv2d_46/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/lraspp/sequential_15/conv2d_47/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/lraspp/sequential_15/conv2d_47/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block/sequential_16/conv2d_51/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "171"}, {"size": "80"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block/sequential_16/conv2d_51/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_1/sequential_17/conv2d_54/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "107"}, {"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_1/sequential_17/conv2d_54/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_2/sequential_18/conv2d_57/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "59"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_2/sequential_18/conv2d_57/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/sequential_19/conv2d_60/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "35"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/sequential_19/conv2d_60/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/sequential_19/conv2d_61/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/sequential_19/conv2d_61/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326", "op": "NoOp", "input": ["^src", "^r1i", "^r4i", "^r3i", "^r2i", "^downsample_ratio"]}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/clip_by_value/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/clip_by_value/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/clip_by_value_1/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/clip_by_value_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/x_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input/_644", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}, {"size": "4"}, {"size": "1"}]}}}}}, {"name": "Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input/_645", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "4"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/crop_to_bounding_box/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/crop_to_bounding_box/stack_1/0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/crop_to_bounding_box/stack_1/3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/output_block/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_2/conv_gru_3/sub/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_2/conv_gru_3/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_2/conv_gru_3/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_2/conv_gru_3/conv2d_58/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_2/conv_gru_3/conv2d_58/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_2/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_1/conv_gru_2/sub/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_1/conv_gru_2/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_1/conv_gru_2/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_1/conv_gru_2/conv2d_55/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "40"}, {"size": "40"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_1/conv_gru_2/conv2d_55/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block_1/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block/conv_gru_1/sub/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block/conv_gru_1/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block/conv_gru_1/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block/conv_gru_1/conv2d_52/Conv2D/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "80"}, {"size": "80"}]}}}}}, {"name": "StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/recurrent_decoder/upsampling_block/conv_gru_1/conv2d_52/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/matting_network_wrapper/StatefulPartitionedCall/input_control_node/_326"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": 